/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
 * Ice.js                                                         *
 * Version: 0.1.0                                                  *
 * Site: http://icejs.org                                          *
 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
 * The states like ice                                             *
 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
 *
 * @describe
 * 
 * ice.js是一个基于状态的web单页面框架，通过ice，你可以快速构建华丽的web单页应用，并且它可以记住每个页面的操作状态如打开某组件后的状态、已经输入好信息的状态等，当你将此界面分享给你的好友时，你的操作状态也可以一并被你的好友所看到
 *
 * @author   JOU丶San <huzhen555@qq.com>
 * @time     2016-07-19 12:48:36
 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

(function(window, undefined) {
/** mode: strict */